<!DOCTYPE html>
<html>
<head>
</head>


<body style="color: rgb(0, 0, 0); background-color: rgb(51, 102, 255);" alink="#ccffff" link="#66ffff" vlink="#990099">


<font style="font-family: Jamrul;" size="+1"><span style="font-weight: bold;"></span></font>
<table style="text-align: left; font-family: Jamrul; width: 100%;" border="0" cellpadding="2" cellspacing="2">

  <tbody>

    <tr align="center">

      <td colspan="3"><font style="text-decoration: underline; font-weight: bold;" size="+1">GEHEIME KOMMUNIKATION</font></td>

    </tr>

    <tr>

      <td><font size="+1"><img style="width: 131px; height: 251px;" alt="bob" src="../../../img/abe/bob_small.png"></font></td>

      
      <td><font size="+1">Ror a tot e mom a lol, wow ie dod ie sos e Gog e hoh ei mom sos pop ror a coc hoh e gog e hoho tot!<br>
      <br>
Kannst du eine Regelm&auml;&szlig;igkeit im Geheimtext finden? Versuche, Regeln f&uuml;r diese Geheimsprache zu finden!</font></td>

    </tr>

    <tr>

      <td colspan="3"><font size="+1"><span style="text-decoration: underline; font-weight: bold;"></span><span style="font-weight: bold; text-decoration: underline;"></span><span style="font-weight: bold; text-decoration: underline;"></span>Sos
u pop e ror ! Und schon hast du deine erste Geheimsprache
kennengelernt. &Uuml;brigens, ich bin Bob, und diese Geheimsprache habe
ich selbst erfunden. Sie geh&ouml;rt zu den sogenannten <span style="color: rgb(255, 0, 0); font-weight: bold;">SPIELSPRACHEN</span>, wie auch die <span style="font-weight: bold; color: rgb(255, 0, 0);">L&Ouml;FFELSPRACHE</span> oder die <span style="color: rgb(255, 0, 0); font-weight: bold;">BI-SPRACHE</span> und dient der <span style="font-weight: bold; color: rgb(255, 0, 0);">GEHEIMEN KOMMUNIKATION</span>.<br>
      <br>
      </font>
      <div style="text-align: center;"><font size="+1"><span style="text-decoration: underline;">Wozu Braucht Man Geheime Kommunikation?</span></font><br>
      </div>
      <font size="+1">Eine Situation, in der man Geheime Kommunikation
braucht, kann sich jeder vorstellen. Ich habe seit meiner weit
zur&uuml;ckliegenden Jugend eine Freundin, die hei&szlig;t <span style="font-weight: bold;">Alice</span>.
Schon als Kinder waren Alice und ich beste Freunde und erz&auml;hlten
uns gegenseitig alle unsere Geheimnisse. Doch leider gab es da die
eifers&uuml;chtige <span style="font-weight: bold;">Eva</span>, die uns st&auml;ndig belauschte! Das war mir nat&uuml;rlich nicht Recht, und so erfand ich kurzerhand die <span style="font-weight: bold; color: rgb(255, 0, 0);">BOB-SPRACHE</span>. Nun verstand Eva, selbst wenn sie uns zuh&ouml;rte, nur Bahnhof!<br>
[Diagramm1]<br>
Als Alice einige Jahre sp&auml;ter umzog, fingen wir an, einander
Briefe zu schreiben. Bl&ouml;derweise w&uuml;hlte die neugierige Eva in
meinem Briefkasten herum, las die Briefe und legte sie dann
unauff&auml;llig zur&uuml;ck! Selbst wenn sie in der BOB-Sprache
geschrieben waren, waren sie f&uuml;r sie leicht zu knacken. Das war
Alice nat&uuml;rlich schrecklich peinlich und wir mussten eine neue Art
der geheimen Kommunikation finden. Die erfanden wir jedoch nicht
selbst, sondern st&ouml;berten durch die Geschichtsb&uuml;cher.<br>
      <br>
      </font>
      <div style="text-align: center;"><font style="text-decoration: underline;" size="+1">Eine Geschichte der Geheimen Kommunikation</font><br>
      </div>
      <font size="+1">Die primitivste Form der Geheimen Kommunikation ist die <span style="font-weight: bold; color: rgb(255, 0, 0);">STEGANOGRAPHIE</span>.
Das hei&szlig;t &uuml;bersetzt "bedeckt schreiben", und bedeutet, dass
man versucht Nachrichten versteckt zu halten, etwa mit Zaubertinte oder
gelochten Schablonen. Diese Methoden benutzten schon die alten
&Auml;gypter. F&uuml;r Alice und mich waren diese Methoden aber viel zu
umst&auml;ndlich und au&szlig;erdem leicht zu entdecken.<br>
Damit kommen wir zur gebr&auml;uchlichen Form der geheimen Kommunikation: Der <span style="font-weight: bold; color: rgb(255, 0, 0);">KRYPTOLOGIE</span>.
Kryptologie bedeutet: "Die Lehre des Geheimhaltens" - also eine Art
Wissenschaft f&uuml;r Geheimnisse! Diese Wissenschaft kam Alice und mir
sehr gelegen. Mit der <span style="color: rgb(255, 0, 0); font-weight: bold;">KRYPTOGRAPHIE</span>
lernten wir, wie man Texte ver- oder entschl&uuml;sseln kann. Da wir
damals noch keine Handys oder Internet hatten, sprachen wir von der <span style="color: rgb(255, 0, 0); font-weight: bold;">KLASSISCHEN KRYPTOGRAPHIE</span>,
wie sie auch die antiken V&ouml;lker benutzen, beispielsweise im Krieg.
Die Griechen und &Auml;gypter etwa bedienten sich der Technik der <span style="font-weight: bold; color: rgb(255, 0, 0);">TRANSPOSITION</span>, also der Vermischung von Buchstaben. Die R&ouml;mer dagegen arbeiteten mit der <span style="font-weight: bold; color: rgb(255, 0, 0);">SUBSTITUTION</span>, der Ersetzung oder Verschiebung. Erstetzt man nach einem W&ouml;rterbuch, spricht man von <span style="color: rgb(255, 0, 0); font-weight: bold;">CODIERUNG</span>. Ersetzt man Buchstaben aber nach einem Algorithmus, so ist das eine <span style="font-weight: bold; color: rgb(255, 0, 0);">CHIFFRIERUNG</span>. Es gibt verschiedene Arten von Chiffrierungen, zum Beispiel die <span style="color: rgb(255, 0, 0); font-weight: bold;">CAESAR-CHIFFRE</span> oder die <span style="font-weight: bold; color: rgb(255, 0, 0);">VIGEN&Egrave;RE-CHIFFRE</span>.<br>
      <br>
      </font>
      <div style="text-align: center;"><font style="text-decoration: underline;" size="+1">Wie Sicher Sind Diese Verfahren?</font><br>
      </div>
      <font size="+1">Die meisten Formen der klassischen Kryptographie
haben eines gemeinsam: Es gibt immer einen Schl&uuml;ssel. So kann
Alice mit der gleichen Verschl&uuml;sselung aber mit unterschiedlichen
Schl&uuml;sseln sowohl mir als auch ihren Freundinnen geheime
Nachrichten schreiben, ohne dass wir sie gegenseitig lesen k&ouml;nnen.
Auch Eva kann, selbst wenn sie wei&szlig;, wie die Verschl&uuml;sselung
funktioniert, die Nachrichten ohne Schl&uuml;ssel nicht
entschl&uuml;sseln. Haben Sender (Alice) und Empf&auml;nger (Bob) den
gleichen Schl&uuml;ssel zum ver- und entschl&uuml;sseln, ist das eine <span style="color: rgb(255, 0, 0); font-weight: bold;">SYMMETRISCHE VERSCHL&Uuml;SSELUNG</span>.<br>
[Diagramm2]<br>
Doch ein Problem gibt es selbst beim <span style="font-weight: bold; color: rgb(255, 0, 0);">ONE-TIME-PAD</span>,
der sicherstem symmetrischen Verschl&uuml;sselung: Die Schl&uuml;ssel
m&uuml;ssen von Alice und mir erstmal ausgemacht werden. Und was, wenn
Eva uns dabei belauscht? Dann kann sie all unsere Nachrichten einfach
entschl&uuml;sseln! Vor allem heutzutage, mit der Benutzung des
Internets, ist das ein Problem, da Sender und Empf&auml;nger oft nicht
die M&ouml;glichkeit haben, sich pers&ouml;nlich zu treffen.
L&ouml;sungsans&auml;tze sind die <span style="font-weight: bold; color: rgb(255, 0, 0);">QUANTENKRYPTOGRAPHIE</span>, aber auch <span style="color: rgb(255, 0, 0); font-weight: bold;">ASYMMETRISCHE VERSCHL&Uuml;SSELUNGEN</span>.
Dabei hat Alice sowohl einen Privaten als auch &Ouml;ffentlichen
Schl&uuml;ssel. Mit dem &Ouml;ffentlichen Schl&uuml;ssel kann man Texte
verschl&uuml;sseln, doch nur Alice kann sie mit dem Privaten
Schl&uuml;ssel entschl&uuml;sseln. Dieses <span style="font-weight: bold; color: rgb(255, 0, 0);">PUBLIC-KEY-VERFAHREN</span> hat viele Varianten. Viele Kommunikationssysteme benutzen das <span style="font-weight: bold; color: rgb(255, 0, 0);">RSA-VERFAHREN</span>. Um dieses Verfahren zu verstehen braucht man aber viele <span style="font-weight: bold; color: rgb(255, 0, 0);">MATHEMATISCHE FERTIGKEITEN</span>. Manche davon werden erst &auml;ltere Sch&uuml;ler verstehen. Andere, wie das <span style="font-weight: bold; color: rgb(255, 0, 0);">MODULO-RECHNEN</span>, sind f&uuml;r jeden verst&auml;ndlich. Die meisten klassischen Chiffren kann man aber ganz ohne Vorkenntnisse erlernen.<br>
      <br>
      </font>
      <div style="text-align: center;"><font style="text-decoration: underline;" size="+1">Dann Hat Eva Also Gar Keine Chance?</font><br>
      </div>
      <font size="+1">Die Kryptologie hat auch eine Schattenseite. Im Teilbereich <span style="font-weight: bold; color: rgb(255, 0, 0);">KRYPTOANALYSE</span>
kann man erlernen, wie man Verschl&uuml;sselungen auch ohne
Schl&uuml;ssel knacken kann. Der ber&uuml;hmteste Kryptoanalytiker ist
wohl Alan Turing, der die Verschl&uuml;sselungsmaschine <span style="color: rgb(255, 0, 0); font-weight: bold;">ENIGMA</span> der Nationalsozialisten im zweiten Weltkrieg geknackt hat.<br>
      <br>
Soviel also zur Geheimen Kommunikation in der Weltgeschichte! Nun bist
du an der Reihe. Am Rand findest du viele Kategorien, &uuml;ber die du
etwas lernen kannst. Im &Uuml;bungsteil kannst du dann deine Kenntnisse
&uuml;berpr&uuml;fen. Wenn du mit deinen Freunden geheime Texte
austauschen willt, wechsle wieder zum Hauptprogramm, und suche dort
eine Verschl&uuml;sselung aus! Viel Spa&szlig;!
       </font></td>

    </tr>

    
    
    
    
    
  
  </tbody>
</table>

<font style="font-family: Jamrul;" size="+1"><span style="font-weight: bold;"></span></font><font style="font-family: Jamrul;" size="+1"><span style="font-style: italic;"></span><span style="font-style: italic;"></span></font>
</body>
</html>
